{
    "activities": [],
    "learningObjectives": [
        "Cyber hygiene",
        "Host hardening",
        "Secure coding practices"
    ],
    "overview": [
        "Computer security, cybersecurity or information technology security (IT security) is the protection of computer systems from theft or damage to their hardware, software or electronic data, as well as from disruption or misdirection of the services they provide.",
        "The field is growing in importance due to increasing reliance on computer systems, the Internet[2] and wireless networks such as Bluetooth and Wi-Fi, and due to the growth of \"smart\" devices, including smartphones, televisions and the various tiny devices that constitute the Internet of things. Due to its complexity, both in terms of politics and technology, it is also one of the major challenges of the contemporary world."
    ],
    "title": "Cyber Security",
    "units": [{
            "activities": [
                "Video on personal cyber hygiene",
                "Video on cyber hygiene helps in reducing cyber attacks",
                "Video on Password hygiene",
                "Reading Activity-1",
                "Video on Privacy and data protection",
                "Reading Activity-2",
                "Discussion Activity",
                "Assignment-1"
            ],
            "learningObjectives": [
                "Cyber hygiene",
                "Password hygiene",
                "Social media hygiene",
                "Privacy and data protection",
                "Ad blocking"

            ],
            "overview": [
                " Cyber hygiene is the establishment and maintenance of an individual's online safety. It is the online analogue of personal hygiene, and encapsulates the daily routines, occasional checks and general behaviours required to maintain a user's online \"health\" (security). This would typically include (but is not limited to): using a firewall, updating virus definitions, running security scans, selecting and maintaining passwords (and other entry systems), updating software, backing-up data and securing personal data.A key aspect of cyber hygiene is that it relates to an individual, rather than a group or an organisation. Cyber hygiene is the responsibility of the individual."
            ],
            "title": "Cyber hygiene"
        },
        {
            "activities": [
                "Reading Activity-1",
                "Discussion Activity-1",
                "Assignment-1",
                "Assignment-2"
            ],
            "learningObjectives": [
                "Cyber hygiene report"
            ],
            "overview": [
                "In this module you will need to create a guided survey using google like google forms (docs), or similar. You will make up questions that are specific to topics related to cyber hygiene. This survey is an anonymous ( and does not require any personally identifiable information from participants). Results of the survey are going to be part of cyber hygiene report you create later in this week."
            ],
            "title": "Cyber Hygiene survey"
        },
        {
            "activities": [
                "Reading Activity-1",
                "Reading Activity-2",
                "Reading Activity-3",
                "Discussion Activity-1",
                "Assignment-1",
                "Assignment-2"
            ],
            "learningObjectives": [
                "Host hardening"
            ],
            "overview": [
                "Host system hardening increases the overall security posture of your computing devices. Three important things for host hardening:<br>1. Determine initial posture of the system<br>2. Minimizing non essential services, applications, and OS features<br>3. Making sure your system has latest patches and hotfixes available."
            ],
            "title": "Host hardening"
        },
        {
            "activities": [
                "Video on What is phishing",
                "Video on Secure websites",
                "Reading Activity-1",
                "Reading Activity-2",
                "Discussion Activity-1",
                "Assignment-1",
                "Assignment-2"
            ],
            "learningObjectives": [
                "Analyse phishing email",
                "compare phishing email to legitimate emai",
                "sketch a sample phishing email",
                "produce training material or guide for avoiding phishing email"
            ],
            "overview": [
                " Phishing is “a broadly launched social engineering attack in which an electronic identity is misrepresented in an attempt to trick individuals into revealing personal credentials that can be used fraudulently against them. “Target the way we, as humans, assign meaning to content.” Semantic attacks take advantage of the way humans interact with computers. Phishing is one type of semantic attack. Phishers make use of the trust that users have on legitimate organizations."
            ],
            "title": "Phishing"
        },
        {
            "activities": [
                "Video 1",
                "Reading Activity-1",
                "Video 2",
                "Video 3",
                "Reading Activity-2",
                "Discussion Activity-1",
                "Assignment-1",
                "Assignment-2"
            ],
            "learningObjectives": [
                "How cambridge analytica scandal happened",
                "Cyber hygiene report"
            ],
            "overview": [
                "In this module we are going to have a case study regarding cambridge analytica scandal, we are going to Summarize cyber hygiene activity, make recommendations for your friends and relatives about cyber hygiene."
            ],
            "title": "Cambridge analytica(Case study)"
        },
        {
            "activities": [
                "Assignment-1"
            ],
            "learningObjectives": [
            ],
            "overview": [
            ],
            "title": "Poster Presentation"
        },
        {
            "activities": [
                "Reading Activity-1",
                "Reading Activity-2",
                "Reading Activity-3",
                "Reading Activity-4",
                "Reading Activity-5",
                "Assignment-1"
            ],
            "learningObjectives": [
                "Secure coding practices in java"
            ],
            "overview": [
                "Securing coding is the practice of developing computer software in a way that guards against the accidental introduction of security vulnerabilities. Defects, bugs and logic flaws are consistently the primary cause of commonly exploited software vulnerabilities. Through the analysis of thousands of reported vulnerabilities, security professionals have discovered that most vulnerabilities stem from a relatively small number of common software programming errors. By identifying the insecure coding practices that lead to these errors and educating developers on secure alternatives, organizations can take proactive steps to help significantly reduce or eliminate vulnerabilities in software before deployment"
            ],
            "title": "Secure coding"
        },
        {
            "activities": [
                "Reading Activity-1",
                "Assignment-1"
            ],
            "learningObjectives": [
                "Code verification",
                "Code review"
            ],
            "overview": [
                "This module is to help software developers reduce the number of vulnerabilities in their code using tools. Static program analysis is performed without actually executing programs.The term is usually applied to the analysis performed by an automated tool, with human analysis being called program understanding, program comprehension, or code review."
            ],
            "title": "Code verification"
        },
        {
            "activities": [
                "Resources",
                "Assignment-1"
            ],
            "learningObjectives": [
                "To create security tools",
                "checklist for computing devices."
            ],
            "overview": [
                " In this module for all your computing devices like laptops, desktops and handheld computing devices such as mobile phones, and tablet PCs identify security tool kit (have a checklist software) that you need to have (or install). This checklist may be application or online service, or it could just be configuring OS. This exercise comes in handy every time you purchase new device or install new operating system."
            ],
            "title": "Endpoint security"
        },
        {
            "activities": [
                "Reading Activity-1",
                "Reading Activity-2",
                "Reading Activity-3",
                "Discussion Activity-1",
                "Assignment-1"
            ],
            "learningObjectives": [
                "How to use public computers"
            ],
            "overview": [
                " Public computers in libraries, Internet cafes, airports, copy shops,school, or even a friend's house can be safe if you follow a few simple rules when you use them. Potential risks while using public computers may include (are not limited to) people gaining access to your online activity if you are using an unsecured or illicit wireless network, there may be 'Shoulder surfing’ – people viewing your screen, loss or theft of your computer, smartphone or tablet, threats from malware including spyware that is already present on public computers, and theft of personal information from or access to browsing history on public computers."
            ],
            "title": "Public computers"
        },
        {
            "activities": [
            ],
            "learningObjectives": [
            ],
            "overview": [
            ],
            "title": "Module-11"
        },
        {
            "activities": [
            ],
            "learningObjectives": [
            ],
            "overview": [
            ],
            "title": "Module-12"
        }


    ]
}